#Использовать InternetMail


ПодключениеИнтернетПочты = Новый ПодключениеИнтернетПочты;
ПодключениеИнтернетПочты.Подключить();

// ПодключитьВнешнююКомпоненту("./bin/1_0_0/MailComponent.dll");

Профиль = Новый ИнтернетПочтовыйПрофиль;

Профиль.АдресСервераSMTP    = "smtp.mail.ru";
Профиль.ПользовательSMTP    = "someuser@mail.ru";
Профиль.ПарольSMTP          = "somepass123";
Профиль.ИспользоватьSSLSMTP = Истина;


Профиль.АдресСервераPOP3    = "pop.mail.ru";
Профиль.ИспользоватьSSLPOP3 = Истина;
Профиль.Пользователь        = "someuser@mail.ru";
Профиль.Пароль              = "somepass123";

Сообщение = Новый ИнтернетПочтовоеСообщение;
Сообщение.Получатели.Добавить("receiver@mail.ru");
Сообщение.ОбратныйАдрес.Добавить("someuser@mail.ru");
Сообщение.Отправитель = "someuser@mail.ru";
Сообщение.Тема        = "Server is down";
Текст =  "
	|<h3>Server is down !</h3>
	|Надо что-то делать.<br/>";

Сообщить("Я все успешно сделал");
